# ####################################################################

#  Created by Genus(TM) Synthesis Solution 23.14-s090_1 on Sun Feb 15 23:59:09 CST 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1fF
set_units -time 1ps

# Set the current design
current_design systolic_top_ARRAY_SIZE8

create_clock -name "clk" -period 1500.0 -waveform {0.0 750.0} [get_ports clk]
set_false_path -from [get_ports rst_n]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports rst_n]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports wr_en_a]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports wr_en_b]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_row_addr[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_row_addr[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_row_addr[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[7][7]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[7][6]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[7][5]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[7][4]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[7][3]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[7][2]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[7][1]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[7][0]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[6][7]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[6][6]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[6][5]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[6][4]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[6][3]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[6][2]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[6][1]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[6][0]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[5][7]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[5][6]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[5][5]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[5][4]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[5][3]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[5][2]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[5][1]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[5][0]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[4][7]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[4][6]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[4][5]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[4][4]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[4][3]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[4][2]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[4][1]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[4][0]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[3][7]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[3][6]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[3][5]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[3][4]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[3][3]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[3][2]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[3][1]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[3][0]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[2][7]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[2][6]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[2][5]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[2][4]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[2][3]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[2][2]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[2][1]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[2][0]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[1][7]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[1][6]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[1][5]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[1][4]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[1][3]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[1][2]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[1][1]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[1][0]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[0][7]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[0][6]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[0][5]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[0][4]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[0][3]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[0][2]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[0][1]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {wr_data[0][0]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports start]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_row_addr[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_row_addr[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_row_addr[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports busy]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports done]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][31]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][30]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][29]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][28]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][27]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][26]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][25]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][24]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][23]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][22]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][21]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][20]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][19]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][18]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][17]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][16]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][15]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][14]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][13]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][12]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][11]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][10]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][9]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][8]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][7]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][6]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][5]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][4]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][3]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][2]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][1]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[7][0]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][31]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][30]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][29]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][28]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][27]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][26]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][25]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][24]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][23]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][22]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][21]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][20]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][19]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][18]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][17]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][16]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][15]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][14]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][13]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][12]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][11]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][10]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][9]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][8]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][7]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][6]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][5]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][4]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][3]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][2]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][1]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[6][0]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][31]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][30]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][29]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][28]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][27]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][26]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][25]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][24]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][23]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][22]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][21]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][20]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][19]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][18]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][17]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][16]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][15]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][14]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][13]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][12]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][11]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][10]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][9]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][8]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][7]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][6]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][5]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][4]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][3]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][2]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][1]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[5][0]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][31]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][30]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][29]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][28]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][27]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][26]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][25]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][24]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][23]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][22]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][21]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][20]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][19]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][18]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][17]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][16]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][15]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][14]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][13]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][12]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][11]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][10]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][9]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][8]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][7]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][6]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][5]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][4]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][3]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][2]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][1]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[4][0]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][31]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][30]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][29]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][28]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][27]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][26]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][25]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][24]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][23]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][22]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][21]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][20]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][19]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][18]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][17]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][16]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][15]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][14]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][13]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][12]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][11]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][10]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][9]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][8]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][7]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][6]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][5]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][4]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][3]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][2]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][1]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[3][0]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][31]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][30]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][29]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][28]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][27]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][26]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][25]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][24]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][23]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][22]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][21]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][20]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][19]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][18]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][17]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][16]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][15]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][14]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][13]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][12]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][11]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][10]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][9]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][8]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][7]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][6]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][5]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][4]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][3]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][2]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][1]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[2][0]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][31]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][30]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][29]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][28]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][27]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][26]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][25]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][24]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][23]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][22]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][21]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][20]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][19]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][18]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][17]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][16]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][15]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][14]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][13]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][12]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][11]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][10]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][9]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][8]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][7]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][6]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][5]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][4]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][3]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][2]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][1]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[1][0]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][31]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][30]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][29]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][28]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][27]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][26]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][25]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][24]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][23]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][22]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][21]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][20]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][19]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][18]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][17]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][16]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][15]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][14]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][13]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][12]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][11]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][10]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][9]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][8]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][7]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][6]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][5]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][4]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][3]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][2]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][1]}]
set_output_delay -clock [get_clocks clk] -add_delay 450.0 [get_ports {rd_data[0][0]}]
